data_generation/Case2/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
260086
(
-6.06938e-13
3.67179e-05
-5.28414e-12
4.03897e-05
-1.04069e-11
4.44287e-05
-1.60068e-11
4.88715e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
-3.67179e-05
-4.03897e-05
-4.44287e-05
-4.88715e-05
-5.37587e-05
-5.91345e-05
-6.5048e-05
-7.15528e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
6.72827e-05
6.86284e-05
7.00009e-05
7.14009e-05
7.28289e-05
7.42855e-05
7.57712e-05
7.72866e-05
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            empty;
        value           nonuniform 0();
    }
    front
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
