data_generation/Case2/constant/cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
130824
(
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
0.635
0.635
0.635
0.635
0.635
0.635
0.635
0.635
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1300
(
0.000406105
0.00121831
0.00203052
0.00284273
0.00365494
0.00446715
0.00527936
0.00609157
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1386
(
-0.000317644
-0.000953366
-0.00158996
-0.00222742
-0.00286575
-0.00350495
-0.00414503
-0.00478598
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
