data_generation/Case2/constant/cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
130824
(
0.0191154
0.0192528
0.0194039
0.0195701
0.0197529
0.019954
0.0201753
0.0204186
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
0.0191154
0.0192528
0.0194039
0.0195701
0.0197529
0.019954
0.0201753
0.0204186
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
0.114156
0.113866
0.113569
0.113267
0.112959
0.112644
0.112323
0.111996
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1300
(
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1386
(
0.01905
0.01905
0.01905
0.01905
0.01905
0.01905
0.01905
0.01905
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
